### pandas

In [1]:
import pandas as pd
import numpy as np

In [2]:
labels = ['a', 'b', 'c']
my_list = [1, 2, 3]
arr = np.array(my_list)
d = {'a':10, 'b':20, 'c':30}

In [3]:
pd.Series(data=my_list)

0    1
1    2
2    3
dtype: int64

In [4]:
pd.Series(my_list, labels)

a    1
b    2
c    3
dtype: int64

In [5]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [6]:
np.random.seed(1)
df = pd.DataFrame(np.random.randn(5,4), index = 'A B C D E'.split(), columns='W X Y Z'.split())

In [7]:
df.head(3)

          W         X         Y         Z
A  1.624345 -0.611756 -0.528172 -1.072969
B  0.865408 -2.301539  1.744812 -0.761207
C  0.319039 -0.249370  1.462108 -2.060141

In [8]:
df

          W         X         Y         Z
A  1.624345 -0.611756 -0.528172 -1.072969
B  0.865408 -2.301539  1.744812 -0.761207
C  0.319039 -0.249370  1.462108 -2.060141
D -0.322417 -0.384054  1.133769 -1.099891
E -0.172428 -0.877858  0.042214  0.582815

In [9]:
df['W']

A    1.624345
B    0.865408
C    0.319039
D   -0.322417
E   -0.172428
Name: W, dtype: float64

In [10]:
df[['W', 'Z']]

          W         Z
A  1.624345 -1.072969
B  0.865408 -0.761207
C  0.319039 -2.060141
D -0.322417 -1.099891
E -0.172428  0.582815

In [11]:
df.W

A    1.624345
B    0.865408
C    0.319039
D   -0.322417
E   -0.172428
Name: W, dtype: float64

In [12]:
df['new'] = df['W']+df.Y

In [13]:
df

          W         X         Y         Z       new
A  1.624345 -0.611756 -0.528172 -1.072969  1.096174
B  0.865408 -2.301539  1.744812 -0.761207  2.610219
C  0.319039 -0.249370  1.462108 -2.060141  1.781147
D -0.322417 -0.384054  1.133769 -1.099891  0.811352
E -0.172428 -0.877858  0.042214  0.582815 -0.130214

In [14]:
df.drop('new', axis=+1)

          W         X         Y         Z
A  1.624345 -0.611756 -0.528172 -1.072969
B  0.865408 -2.301539  1.744812 -0.761207
C  0.319039 -0.249370  1.462108 -2.060141
D -0.322417 -0.384054  1.133769 -1.099891
E -0.172428 -0.877858  0.042214  0.582815

In [15]:
df

          W         X         Y         Z       new
A  1.624345 -0.611756 -0.528172 -1.072969  1.096174
B  0.865408 -2.301539  1.744812 -0.761207  2.610219
C  0.319039 -0.249370  1.462108 -2.060141  1.781147
D -0.322417 -0.384054  1.133769 -1.099891  0.811352
E -0.172428 -0.877858  0.042214  0.582815 -0.130214

In [16]:
df.drop('new', axis=+1, inplace = True)

In [17]:
df

          W         X         Y         Z
A  1.624345 -0.611756 -0.528172 -1.072969
B  0.865408 -2.301539  1.744812 -0.761207
C  0.319039 -0.249370  1.462108 -2.060141
D -0.322417 -0.384054  1.133769 -1.099891
E -0.172428 -0.877858  0.042214  0.582815

In [18]:
df.loc['A']

W    1.624345
X   -0.611756
Y   -0.528172
Z   -1.072969
Name: A, dtype: float64

In [19]:
df > 0

       W      X      Y      Z
A   True  False  False  False
B   True  False   True  False
C   True  False   True  False
D  False  False   True  False
E  False  False   True   True

In [20]:
df[df>0]

          W   X         Y         Z
A  1.624345 NaN       NaN       NaN
B  0.865408 NaN  1.744812       NaN
C  0.319039 NaN  1.462108       NaN
D       NaN NaN  1.133769       NaN
E       NaN NaN  0.042214  0.582815

In [21]:
df['W']>0

A     True
B     True
C     True
D    False
E    False
Name: W, dtype: bool

In [22]:
df[df['W']>0]

          W         X         Y         Z
A  1.624345 -0.611756 -0.528172 -1.072969
B  0.865408 -2.301539  1.744812 -0.761207
C  0.319039 -0.249370  1.462108 -2.060141

In [23]:
df.reset_index()

  index         W         X         Y         Z
0     A  1.624345 -0.611756 -0.528172 -1.072969
1     B  0.865408 -2.301539  1.744812 -0.761207
2     C  0.319039 -0.249370  1.462108 -2.060141
3     D -0.322417 -0.384054  1.133769 -1.099891
4     E -0.172428 -0.877858  0.042214  0.582815

In [24]:
df = pd.DataFrame({'col1':[1,2,3,4],
                  'col2':[444,555,666,444],
                  'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [25]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [26]:
df['col2'].nunique()

3

In [27]:
len(df['col2'].unique())

3

In [28]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [29]:
df[df['col1']>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [30]:
df[(df['col1']>2)  | (df['col2']==444)]

   col1  col2 col3
0     1   444  abc
2     3   666  ghi
3     4   444  xyz

In [31]:
df[(df['col1']>2)  & (df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

In [32]:
def times2(x):
    return x * 2

In [33]:
df['col1']

0    1
1    2
2    3
3    4
Name: col1, dtype: int64

In [34]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [35]:
df['col2']

0    444
1    555
2    666
3    444
Name: col2, dtype: int64

In [36]:
df['col2'].apply(lambda x : x * 2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [37]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [38]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [39]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [40]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

:مطالعه بیشتر

* dict
* itertools
* enumerate
* higher order indexing